Repository: diegosiao/DBBroker
Catalog: DBBroker/Properties/Resources.*.resx
Languages: pt

# AssemblyNotFound
source: The informed namespace '{0}' was not found in the application context.
pt: O namespace informado '{0}' não foi achado no contexto da aplicação.

# DBBrokerConfigConnStrNotFound
source: A corresponding ConnectionString was not found to the namespace '{0}'.
pt: Uma 'Connection String' não foi encontrada para o namespace '{0}'.

# DBBrokerConfigDatabaseOption
source: As database option, you need to inform 'SQLServer' or 'MySQL' (MySQL not fully supported).
pt: Informe 'SQLServer' ou 'MySQL' como a engine escolhida (MySQL não suportado completamente).

# DBBrokerConfigFileAlreadyEncripted
source: The 'DBBroker.config' is already encrypted.
pt: O arquivo 'DBBroker.config' já foi criptografado.

# DBBrokerConfigFileFormat
source: Every line of the DBBroker.config file must have the format: 'My.Namespace|{SQLServer or MySQL}|ConnectionString'.
pt: Cada linha do arquivo DBBroker.config precisa estar no formato: 'Namespace|SQLServer [ou] MySQL|Connection String'. Ex.: MyApp.Domain|SQLServer|Data Source=(local); User Id=sa; Password=SuperSenha; Initial Catalog=database;

# DBBrokerConfigFileNotFound
source: The DBBroker.config configuration file was not found in '{0}'.
pt: O arquivo de configuração 'DBBroker.config' não foi encontrado em '{0}'.

# DBBrokerConfigInfoIncomplete
source: Please inform lines of the configuration file as elements of the array. Array null or empty.
pt: Informe as linhas do arquivo de configuração como elementos do array. Array nulo ou vazio.

# DBBrokerScriptMessage
source: /* Generated as a courtesy without warranty by DBBroker */ /* ==================================================== */ /* Why not paying a coffee for us at www.getdbbroker.com? */ /* We need your help to keep moving. */ /* Donations via PayPal - quick and safe ;) */ /* Creation: {0} */ /* [!] - REMEMBER TO CREATE OR SET THE PROPER DATABASE CONTEXT BEFORE YOU RUN THIS SCRIPT; - REVISE THIS SCRIPT; */
pt: /* Gerado sem garantia por cortesia de DBBroker */ /* ============================================ */ /* Por que não nos pagar um cafezinho em www.getdbbroker.com? */ /* Doações via PagSeguro ou PayPal... é rápido e seguro ;) */ /* Criação: {0} */ /* [!] - REVISE ESTE SCRIPT; - LEMBRE-SE DE CRIAR OU SETAR O BANCO DE DADOS APROPRIADO NO CONTEXTO ANTES DE EXECUTAR ESTE SCRIPT; */

# EncryptionPasswordInvalid
source: The format of the encrypted DBBroker.config file is invalid. Make sure you are using the same password used to create it (Configuration.EncryptionPassword).
pt: O formato do arquivo criptografado DBBroker.config está inválido. Tenha certeza de estar informando a mesma senha de criptografia usada para criá-lo (Configuration.EncryptionPassword).

# EncryptionPasswordNull
source: The encryption password in property 'Configuration.EncryptionPassword' cannot be null or shorter than 6 characters when working with encrypted DBBroker.config file.
pt: A senha de criptografia não pode ser nula ou ter menos que 6 caracteres na propriedade 'Configuration.EncryptionPassword' quando o arquivo de configuração DBBroker.config está criptografado.

# ErrorBadList
source: The property '{0}' needs to be of type 'System.Collections.Generic.List'.
pt: A lista mapeada '{0}' precisa ser do tipo 'System.Collections.Generic.List'.

# ErrorConfigFileHasNoSuchLine
source: The DBBroker.config file has does not have the line '{0}'. It has '{1}' line(s).
pt: O arquivo DBBroker.config não tem a linha '{0}'. Este arquivo tem '{1}' linha(s).

# ErrorConfigurationContextRequired
source: The configuration context cannot be null.
pt: O contexto de configuração não pode ser nulo.

# ErrorExecutingSqlCommand
source: The execution of the SQL script failed. {0} SQL: '{1}'. (That message is restrict to debugging)
pt: A execução do script SQL falhou. {0} SQL: '{1}'. (Mensagem restrita enquanto debugando)

# ErrorIdValueNotValid
source: The value found in {0} to 'Id' property is invalid integer.
pt: O valor encontrado em {0} para a propriedade 'Id' não é um inteiro válido.

# ErrorIncompleteMap
source: Please inform the corresponding table and primary key to the class '{0}' using the [DBMappedClass] attribute in this class.
pt: Informe a tabela e chave primária para '{0}' usando o atributo [DBMappedClass] nessa classe.

# ErrorLoadingProp
source: Fail during the load of property '{0}.{1}'. {2}.
pt: Falha durante a carga da propriedade '{0}.{1}'. {2}.

# ErrorMappedListCheckMapping
source: Por favor, verifique os valores do atributo [DBMappedList] na propriedade '{0}.{1}'. Há algo errado.
pt: Please check the attribute [DBMappedList] values in property '{0}.{1}'. Something is wrong.

# ErrorMappedListInfo
source: Please inform all properties of the attribute [DBMappedList] of '{0}.{1}'.
pt: Informe todas as propriedades do atributo [MappedList] em '{0}.{1}'.

# ErrorMappedListUsage
source: The property '{0}.{1}' must be of type 'System.Collections.Generic.List'
pt: A propriedade '{0}.{1}' precisa ser de um tipo que implemente 'IList'

# ErrorMessageDefault
source: Oops... Something went wrong during a try of recovering data.
pt: Desculpe... Algo não funcionou como esperado.

# ErrorMissingIdProp
source: Every mapped class need a 'Id' integer property. The class '{0}' does not have it.
pt: Toda classe mapeada precisa de uma propriedade 'Id' do tipo integer. A classe '{0}' não tem.

# ErrorMultipleDatabases
source: Wow... DBBroker does not allow multiple databases mechanisms (SQLServer and MySQL) in the same context. That would be a mess.
pt: O DBBroker não permite mais de um mecanismo de banco (SQLServer e MySQL) no mesmo contexto. Isso seria uma bagunça.

# ErrorNamespaceAlreadyInformed
source: The namespace '{0}' appears more than once in DBBroker.config file.
pt: O namespace '{0}' aparece mais de uma vez no arquivo DBBroker.config.

# ErrorNamespaceNotFound
source: The namespace '{0}' was not specified in the file DBBroker.config
pt: O namespace '{0}' não foi especificado no arquivo DBBroker.config

# ErrorSavingObject
source: Something went wrong while saving the data to '{0}'.
pt: Algo deu errado ao salvar os dados para '{0}'.

# ErrorScriptMultipleNamespacesMapped
source: There is more than one mapped namespaces. Please use the ScriptGenerator constructor where you can specify a namespace.
pt: Existe mais de um namespace mapeado. Use o construtor de ScriptGenerator em que é possível especificar o namespace.

# ErrorTranAssociatedConnectionNull
source: The transaction specified has an invalid connection.
pt: A transação especificada tem uma conexão inválida.

# ErrorUnexpectedNullProp
source: Internal unexpected error. [581]
pt: Erro interno. [581]

# MultipleAssembliesWithSameNamespace
source: There is more than one assembly in context with the namespace '{0}'.
pt: Existe mais de um assembly no contexto com o namespace '{0}'.

# NullOrEmptyColumnName
source: The column name cannot be null or empty.
pt: O nome da coluna não pode ser nulo ou vazio.

source: Unnamed
pt: Anônima

# WarningPropertyNotMapped
source: WARNING: The property '{0}' was not mapped. Type not convertible: {1}
pt: ATENÇÃO: A propriedade '{0}' não foi mapeada. Tipo não pode ser convertido: {1}

# WarningTransactionNotCommited
source: Make sure you commit the external transaction informed.
pt: Certifique-se de invocar o 'Commit' da transação informada
